# Insulation Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
WireType..::..Insulation Property
WireType Class See Also
---
The insulation type.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public InsulationType Insulation { get; set; }
```

Visual Basic
---
```text
Public Property Insulation As InsulationType
	Get
	Set
```

Visual C++
---
```text
public:
property InsulationType^ Insulation {
	InsulationType^ get ();
	void set (InsulationType^ value);
}
```

# See Also
WireType Class
Autodesk.Revit.DB.Electrical Namespace